import random

print("Вітаю, Ви Колобок і Вас поставили на вікні простигати. Ваші дії:")
print("1 - втекти")
print("2 - залишитися")

a = input("Виберіть дію: ")

if a == "1":
    print("Ви зустріли зайця. Ваші дії:")
    print("1 - заспівати пісню і втекти")
    print("2 - прикинутися пітоном")
    print("3 - прикинутися мухомором")
elif a == "2" :
    print("Вас з'їли дід та баба. Гра закінчена.")
    quit()
else:
    print("Виберіть 1 або 2. Гра закінчена.")
    quit()

b = input("Виберіть дію: ")

if b == "1":
    print("Ви втекли від зайця. Ви зустріли лисицю. Ваші дії")
    print("1 - заспівати пісню і втекти.")
    print("3 - сказати 'Я хворий на коронавірус'")
    print("4 - сказати 'Я зроблений з ГМО зерна'")
elif b == "2" or b == "3":
    y = random.choice([True, False])
    if y == True:
        print("Ви втекли від зайця. Ви зустріли лисицю. Ваші дії")
        print("1 - заспівати пісню і втекти.")
        print("3 - сказати 'Я хворий на коронавірус'")
        print("4 - сказати 'Я зроблений з ГМО зерна'")
    else:
        print("Заєць Вам не повірив і Вас з'їв. Гра закінчена. ")
        quit()
else:
    print("Виберіть 1, 2 або 3. Гра закінчена.")
    quit()

s = input("Виберіть дію: ")

if s == "1":
    y = random.choice([True, False])
    if y == True:
        print("Ви втекли від лисиці. Гра закінчена.")
        quit()
    else:
        print("Ви не втекли3"
              " від лисиці і вона Вас з'їла. Гра закінчена.")
        quit()
elif s == "2" or "3" or "4":
    y = random.choice([True, False])
    if y == True:
        print("Лисиця Вам повірила і Ви втекли. Гра закінчена.")
        quit()
    else:
        print("Лисиця Вам не повірила і з'їла. Гра закінчена. ")
        quit()
else:
    print("Виберіть 1, 2, 3, 4. Гра закінчена.")
    quit()